Terraform plan for __ibo__
<details>
<summary>Plan: 4 to add, 1 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_project_iam_member.sprinkle_analytics_iam[0] will be created
  + resource "google_project_iam_member" "sprinkle_analytics_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ibo-prod"
      + role    = "roles/bigquery.admin"
    }

  # google_service_account.sprinkle_analytics[0] will be created
  + resource "google_service_account" "sprinkle_analytics" {
      + account_id   = "******************"
      + disabled     = false
      + display_name = "Service account for application deployment"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account_key.sprinkle_analytics_key[0] will be created
  + resource "google_service_account_key" "sprinkle_analytics_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "****************************"
      + public_key         = (known after apply)
      + public_key_type    = "******************"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # google_storage_bucket_object.sprinkle_analytics_key_bucket_object[0] will be created
  + resource "google_storage_bucket_object" "sprinkle_analytics_key_bucket_object" {
      + bucket         = "ibo-prod"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "sprinkle-analytics-prod.key"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

  # module.inventory_google_postgres.google_sql_database_instance.default will be updated in-place
  ~ resource "google_sql_database_instance" "default" {
        id                            = "ibo-prd-db-5cabdfdf"
        name                          = "ibo-prd-db-5cabdfdf"
        # (12 unchanged attributes hidden)

      ~ settings {
            # (10 unchanged attributes hidden)

          ~ backup_configuration {
              - location                       = "asia" -> null
                # (5 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

          - database_flags {
              - name  = "log_min_duration_statement" -> null
              - value = "100" -> null
            }



          ~ maintenance_window {
              ~ hour         = 21 -> 23
                # (2 unchanged attributes hidden)
            }
            # (12 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #483](https://github.com/ebomart/commerce-infrastructure/actions/runs/1962541697)